# SQL for Data Analyst
- [Basic][1]
- [Join][2]
- [Aggregation][3]
[1]:http://127.0.0.1:8888/notebooks/SQL4DA/Basic.ipynb
[2]:http://127.0.0.1:8888/notebooks/SQL4DA/Join.ipynb
[3]:http://127.0.0.1:8888/notebooks/SQL4DA/Aggregation.ipynb

# Chapter 2. Join
   - [Quiz1][3]
   - [Quiz2][4]
   - [Quiz3][5]
   - [Quiz4][6]
   - [Quiz5][7]
   - [Quiz6][8]
   - [Quiz7][9]
   - [Quiz8][10]
[2]:#Join
[3]:#Quiz-1
[4]:#Quiz-2
[5]:#Quiz-3
[6]:#Quiz-4
[7]:#Quiz-5
[8]:#Quiz-6
[9]:#Quiz-7
[10]:#Quiz-8

In [3]:
%load_ext autoreload
%autoreload 2
from Query import *

In [4]:
Query = query('test')
#Query.get_table()
#Query.sql2db('parch-and-posey.sql')
Query.connect()

## Basic

# Join

### Quiz 1
Provide a table that provides the region for each sales_rep along with their associated accounts. This time only for the Midwest region. Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.

### Quiz 2
Provide a table that provides the region for each sales_rep along with their associated accounts. `This time only for accounts where the sales rep has a first name starting with S and in the Midwest region.` Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.

In [34]:
com = readcom('workout.txt')
result = Query.execute(com)
result.head()

SELECT r.name region, s.name rep, a.name account_name
    FROM accounts a
    JOIN sales_reps s ON s.id = a.sales_rep_id
    JOIN region r ON r.id = s.region_id
    WHERE rep LIKE 'S%' AND region = 'Midwest'
    ORDER BY account_name

    region                    rep              account_name
0  Midwest  Sherlene Wetherington  Community Health Systems
1  Midwest  Sherlene Wetherington               Progressive
2  Midwest  Sherlene Wetherington                  Rite Aid
3  Midwest  Sherlene Wetherington         Time Warner Cable
4  Midwest  Sherlene Wetherington              U.S. Bancorp

### Quiz 3
Provide a table that provides the region for each sales_rep along with their associated accounts. `This time only for accounts where the sales rep has a last name starting with K and in the Midwest region.` Your final table should include three columns: the region name, the sales rep name, and the account name. Sort the accounts alphabetically (A-Z) according to account name.

In [39]:
com = readcom('workout.txt')
result = Query.execute(com)
result.head()

SELECT r.name region, s.name rep, a.name account_name
    FROM accounts a
    JOIN sales_reps s ON s.id = a.sales_rep_id
    AND rep LIKE '% K%'
    JOIN region r ON r.id = s.region_id
    AND region = 'Midwest'

    region                rep         account_name
0  Midwest  Carletta Kosinski              Danaher
1  Midwest  Carletta Kosinski       Dollar General
2  Midwest  Carletta Kosinski  International Paper
3  Midwest  Carletta Kosinski           McDonald's
4  Midwest  Carletta Kosinski     Northrop Grumman

# Quiz 4
Provide the name for each region for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. However, you should only provide the results if the standard order quantity exceeds 100. Your final table should have 3 columns: region name, account name, and unit price. In order to avoid a division by zero error, adding .01 to the denominator here is helpful total_amt_usd/(total+0.01).

In [7]:
com = readcom('workout.txt')
result = Query.execute(com)
result.head()

SELECT
    r.name region,
    a.name account_name,
    (o.total_amt_usd/(o.total+0.01)) AS unit_price
    FROM accounts a
    JOIN sales_reps s ON s.id = a.sales_rep_id
    JOIN region r ON r.id = s.region_id
    JOIN orders o ON o.account_id = a.id
    AND o.standard_qty > 100

      region account_name  unit_price
0  Northeast      Walmart    5.759600
1  Northeast      Walmart    5.965175
2  Northeast      Walmart    5.444236
3  Northeast      Walmart    5.960184
4  Northeast      Walmart    6.168719

# Quiz 5
Provide the name for each region for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. However, you should only provide the results if the standard order quantity exceeds 100 and the poster order quantity exceeds 50. Your final table should have 3 columns: region name, account name, and unit price. Sort for the smallest unit price first. In order to avoid a division by zero error, adding .01 to the denominator here is helpful (total_amt_usd/(total+0.01).

In [16]:
com = readcom('workout.txt')
result = Query.execute(com)
result.head()

SELECT
    r.name region,
    a.name account_name,
    (o.total_amt_usd/(o.total+0.01)) AS unit_price
    FROM accounts a
    JOIN sales_reps s ON s.id = a.sales_rep_id
    JOIN region r ON r.id = s.region_id
    JOIN orders o ON o.account_id = a.id
    WHERE o.standard_qty > 100 AND o.poster_qty > 50
    ORDER BY unit_price

      region               account_name  unit_price
0  Northeast  State Farm Insurance Cos.    5.119282
1  Southeast               DISH Network    5.231816
2  Northeast             Travelers Cos.    5.235181
3  Northeast                   Best Buy    5.260426
4       West     Stanley Black & Decker    5.266396

# Quiz 6
Provide the name for each region for every order, as well as the account name and the unit price they paid (total_amt_usd/total) for the order. However, you should only provide the results if the standard order quantity exceeds 100 and the poster order quantity exceeds 50. Your final table should have 3 columns: region name, account name, and unit price. Sort for the largest unit price first. In order to avoid a division by zero error, adding .01 to the denominator here is helpful (total_amt_usd/(total+0.01).

In [18]:
com = readcom('workout.txt')
result = Query.execute(com)
result.head()

SELECT
    r.name region,
    a.name account_name,
    (o.total_amt_usd/(o.total+0.01)) AS unit_price
    FROM accounts a
    JOIN sales_reps s ON s.id = a.sales_rep_id
    JOIN region r ON r.id = s.region_id
    JOIN orders o ON o.account_id = a.id
    WHERE o.standard_qty > 100 AND o.poster_qty > 50
    ORDER BY unit_price DESC

      region                 account_name  unit_price
0  Northeast                          IBM    8.089906
1       West                       Mosaic    8.066329
2       West                 Pacific Life    8.063023
3  Northeast                          CHS    8.018849
4       West  Fidelity National Financial    7.992802

# Quiz 7
What are the different channels used by account id 1001? Your final table should have only 2 columns: account name and the different channels. You can try SELECT DISTINCT to narrow down the results to only the unique values.

### Key Point
#### `The SQL SELECT DISTINCT Statement`
The SELECT DISTINCT statement is used to `return only distinct (different) values`.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.

In [20]:
com = readcom('workout.txt')
result = Query.execute(com)
result.head()

SELECT DISTINCT a.name account_name,
    w.channel
    FROM accounts a
    JOIN web_events w ON w.account_id = a.id
    WHERE a.id = 1001

  account_name   channel
0      Walmart   adwords
1      Walmart    banner
2      Walmart    direct
3      Walmart  facebook
4      Walmart   organic

# Quiz 8
Find all the orders that occurred in 2015. Your final table should have 4 columns: occurred_at, account name, order total, and order total_amt_usd.

### Key Point
#### `Time Range`
The BETWEEN operator in SQL is inclusive; that is, the endpoint values are included.

Using BETWEEN is tricky for dates! It assumes the time is at 00:00:00 (i.e. midnight) for dates. This is the reason why we `set the right-side endpoint of the period at '2016-01-01'`.

In [26]:
com = readcom('workout.txt')
result = Query.execute(com)
result.head()

SELECT o.occurred_at, o.total, o.total_amt_usd, a.name account_name
FROM accounts a
JOIN orders o ON o.account_id = a.id
WHERE o.occurred_at BETWEEN '2015-01-01' AND '2015-12-31'
ORDER BY o.occurred_at DESC

           occurred_at  total  total_amt_usd          account_name
0  2015-12-30 20:04:55    121         623.79  Occidental Petroleum
1  2015-12-30 19:01:13    340        1819.22                   CHS
2  2015-12-30 17:31:09   1314        8632.07                Pfizer
3  2015-12-30 17:30:33    327        1762.44                 Fluor
4  2015-12-30 17:17:03    869        6311.35                 Fluor

# Aggregation